Revit 2027 API
IFCParameterTemplate.SetPropertySetApplicableEntities Method
Note: This API is now obsolete.
 Sets the list of IFC entities to which the property set is applicable.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This is deprecated in Revit 2027 and will be removed in the next version of Revit.")]
public void SetPropertySetApplicableEntities(
	PropertySetupType propertySetupType,
	string propertySetName,
	IList<string> applicableEntities
)
<ObsoleteAttribute("This is deprecated in Revit 2027 and will be removed in the next version of Revit.")>
Public Sub SetPropertySetApplicableEntities (
	propertySetupType As PropertySetupType,
	propertySetName As String,
	applicableEntities As IList(Of String)
)
public:
[ObsoleteAttribute(L"This is deprecated in Revit 2027 and will be removed in the next version of Revit.")]
void SetPropertySetApplicableEntities(
	PropertySetupType propertySetupType,
	String^ propertySetName,
	IList<String^>^ applicableEntities
)
[<ObsoleteAttribute("This is deprecated in Revit 2027 and will be removed in the next version of Revit.")>]
member SetPropertySetApplicableEntities :
        propertySetupType : PropertySetupType *
        propertySetName : string *
        applicableEntities : IList<string> -> unit
Parameters
propertySetupType PropertySetupType
 The property setup type.
propertySetName String
 The property set name.
applicableEntities IList<String>
 The list of IFC entities to which the property set is applicable.
Exceptions
Exception | Condition
ArgumentException |  A property set with the given name is not present in the template.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
IFCParameterTemplate Class
Autodesk.Revit.DB Namespace